benchmarks/results/20260308_235901/02_auth.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: benchmarks/auth_load.js
        output: json (benchmarks/results/20260308_235901/02_auth.json)

     scenarios: (100.00%) 1 scenario, 1 max VUs, 1m30s max duration (incl. graceful stop):
              * default: Up to 1 looping VUs for 1m0s over 2 stages (gracefulRampDown: 30s, gracefulStop: 30s)

time="2026-03-09T00:00:02+05:30" level=info msg="[setup] Benchmark user ready: benchmark@meghan.test" source=console

running (0m01.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 1/1 VUs  0m01.0s/1m00.0s

running (0m02.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
default   [   3% ] 1/1 VUs  0m02.0s/1m00.0s

running (0m03.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
default   [   5% ] 1/1 VUs  0m03.0s/1m00.0s

running (0m04.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
default   [   7% ] 1/1 VUs  0m04.0s/1m00.0s

running (0m05.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
default   [   8% ] 1/1 VUs  0m05.0s/1m00.0s

running (0m06.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
default   [  10% ] 1/1 VUs  0m06.0s/1m00.0s

running (0m07.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
default   [  12% ] 1/1 VUs  0m07.0s/1m00.0s

running (0m08.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
default   [  13% ] 1/1 VUs  0m08.0s/1m00.0s

running (0m09.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
default   [  15% ] 1/1 VUs  0m09.0s/1m00.0s

running (0m10.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
default   [  17% ] 1/1 VUs  0m10.0s/1m00.0s

running (0m11.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
default   [  18% ] 1/1 VUs  0m11.0s/1m00.0s

running (0m12.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
default   [  20% ] 1/1 VUs  0m12.0s/1m00.0s

running (0m13.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
default   [  22% ] 1/1 VUs  0m13.0s/1m00.0s

running (0m14.0s), 1/1 VUs, 10 complete and 0 interrupted iterations
default   [  23% ] 1/1 VUs  0m14.0s/1m00.0s

running (0m15.0s), 1/1 VUs, 10 complete and 0 interrupted iterations
default   [  25% ] 1/1 VUs  0m15.0s/1m00.0s

running (0m16.0s), 1/1 VUs, 11 complete and 0 interrupted iterations
default   [  27% ] 1/1 VUs  0m16.0s/1m00.0s

running (0m17.0s), 1/1 VUs, 12 complete and 0 interrupted iterations
default   [  28% ] 1/1 VUs  0m17.0s/1m00.0s

running (0m18.0s), 1/1 VUs, 12 complete and 0 interrupted iterations
default   [  30% ] 1/1 VUs  0m18.0s/1m00.0s

running (0m19.0s), 1/1 VUs, 13 complete and 0 interrupted iterations
default   [  32% ] 1/1 VUs  0m19.0s/1m00.0s

running (0m20.0s), 1/1 VUs, 14 complete and 0 interrupted iterations
default   [  33% ] 1/1 VUs  0m20.0s/1m00.0s

running (0m21.0s), 1/1 VUs, 14 complete and 0 interrupted iterations
default   [  35% ] 1/1 VUs  0m21.0s/1m00.0s

running (0m22.0s), 1/1 VUs, 15 complete and 0 interrupted iterations
default   [  37% ] 1/1 VUs  0m22.0s/1m00.0s

running (0m23.0s), 1/1 VUs, 16 complete and 0 interrupted iterations
default   [  38% ] 1/1 VUs  0m23.0s/1m00.0s

running (0m24.0s), 1/1 VUs, 17 complete and 0 interrupted iterations
default   [  40% ] 1/1 VUs  0m24.0s/1m00.0s

running (0m25.0s), 1/1 VUs, 17 complete and 0 interrupted iterations
default   [  42% ] 1/1 VUs  0m25.0s/1m00.0s

running (0m26.0s), 1/1 VUs, 18 complete and 0 interrupted iterations
default   [  43% ] 1/1 VUs  0m26.0s/1m00.0s

running (0m27.0s), 1/1 VUs, 19 complete and 0 interrupted iterations
default   [  45% ] 1/1 VUs  0m27.0s/1m00.0s

running (0m28.0s), 1/1 VUs, 19 complete and 0 interrupted iterations
default   [  47% ] 1/1 VUs  0m28.0s/1m00.0s

running (0m29.0s), 1/1 VUs, 20 complete and 0 interrupted iterations
default   [  48% ] 1/1 VUs  0m29.0s/1m00.0s

running (0m30.0s), 1/1 VUs, 21 complete and 0 interrupted iterations
default   [  50% ] 1/1 VUs  0m30.0s/1m00.0s

running (0m31.0s), 1/1 VUs, 22 complete and 0 interrupted iterations
default   [  52% ] 1/1 VUs  0m31.0s/1m00.0s

running (0m32.0s), 1/1 VUs, 22 complete and 0 interrupted iterations
default   [  53% ] 1/1 VUs  0m32.0s/1m00.0s

running (0m33.0s), 1/1 VUs, 23 complete and 0 interrupted iterations
default   [  55% ] 1/1 VUs  0m33.0s/1m00.0s

running (0m34.0s), 1/1 VUs, 24 complete and 0 interrupted iterations
default   [  57% ] 1/1 VUs  0m34.0s/1m00.0s

running (0m35.0s), 1/1 VUs, 25 complete and 0 interrupted iterations
default   [  58% ] 1/1 VUs  0m35.0s/1m00.0s

running (0m36.0s), 1/1 VUs, 25 complete and 0 interrupted iterations
default   [  60% ] 1/1 VUs  0m36.0s/1m00.0s

running (0m37.0s), 1/1 VUs, 26 complete and 0 interrupted iterations
default   [  62% ] 1/1 VUs  0m37.0s/1m00.0s

running (0m38.0s), 1/1 VUs, 27 complete and 0 interrupted iterations
default   [  63% ] 1/1 VUs  0m38.0s/1m00.0s

running (0m39.0s), 1/1 VUs, 27 complete and 0 interrupted iterations
default   [  65% ] 1/1 VUs  0m39.0s/1m00.0s

running (0m40.0s), 1/1 VUs, 28 complete and 0 interrupted iterations
default   [  67% ] 1/1 VUs  0m40.0s/1m00.0s

running (0m41.0s), 1/1 VUs, 29 complete and 0 interrupted iterations
default   [  68% ] 1/1 VUs  0m41.0s/1m00.0s

running (0m42.0s), 1/1 VUs, 30 complete and 0 interrupted iterations
default   [  70% ] 1/1 VUs  0m42.0s/1m00.0s

running (0m43.0s), 1/1 VUs, 30 complete and 0 interrupted iterations
default   [  72% ] 1/1 VUs  0m43.0s/1m00.0s

running (0m44.0s), 1/1 VUs, 31 complete and 0 interrupted iterations
default   [  73% ] 1/1 VUs  0m44.0s/1m00.0s

running (0m45.0s), 1/1 VUs, 32 complete and 0 interrupted iterations
default   [  75% ] 1/1 VUs  0m45.0s/1m00.0s

running (0m46.0s), 1/1 VUs, 32 complete and 0 interrupted iterations
default   [  77% ] 1/1 VUs  0m46.0s/1m00.0s

running (0m47.0s), 1/1 VUs, 33 complete and 0 interrupted iterations
default   [  78% ] 1/1 VUs  0m47.0s/1m00.0s

running (0m48.0s), 1/1 VUs, 34 complete and 0 interrupted iterations
default   [  80% ] 1/1 VUs  0m48.0s/1m00.0s

running (0m49.0s), 1/1 VUs, 35 complete and 0 interrupted iterations
default   [  82% ] 1/1 VUs  0m49.0s/1m00.0s

running (0m50.0s), 1/1 VUs, 35 complete and 0 interrupted iterations
default   [  83% ] 1/1 VUs  0m50.0s/1m00.0s

running (0m51.0s), 1/1 VUs, 36 complete and 0 interrupted iterations
default   [  85% ] 1/1 VUs  0m51.0s/1m00.0s

running (0m52.0s), 1/1 VUs, 37 complete and 0 interrupted iterations
default   [  87% ] 1/1 VUs  0m52.0s/1m00.0s

running (0m53.0s), 1/1 VUs, 38 complete and 0 interrupted iterations
default   [  88% ] 1/1 VUs  0m53.0s/1m00.0s

running (0m54.0s), 1/1 VUs, 38 complete and 0 interrupted iterations
default   [  90% ] 1/1 VUs  0m54.0s/1m00.0s

running (0m55.0s), 1/1 VUs, 39 complete and 0 interrupted iterations
default   [  92% ] 1/1 VUs  0m55.0s/1m00.0s

running (0m56.0s), 1/1 VUs, 40 complete and 0 interrupted iterations
default   [  93% ] 1/1 VUs  0m56.0s/1m00.0s

running (0m57.0s), 1/1 VUs, 40 complete and 0 interrupted iterations
default   [  95% ] 1/1 VUs  0m57.0s/1m00.0s

running (0m58.0s), 1/1 VUs, 41 complete and 0 interrupted iterations
default   [  97% ] 1/1 VUs  0m58.0s/1m00.0s

running (0m59.0s), 1/1 VUs, 42 complete and 0 interrupted iterations
default   [  98% ] 1/1 VUs  0m59.0s/1m00.0s

running (1m00.0s), 1/1 VUs, 43 complete and 0 interrupted iterations
default   [ 100% ] 1/1 VUs  1m00.0s/1m00.0s

running (1m01.0s), 1/1 VUs, 43 complete and 0 interrupted iterations
default ↓ [ 100% ] 1/1 VUs  1m0s

     ✓ POST /api/auth/login-json → 200
     ✓ POST /api/auth/login-json → token
     ✓ POST /api/auth/login-json → p95 <700ms

     checks.........................: 100.00% 132 out of 132
     data_received..................: 14 kB   227 B/s
     data_sent......................: 9.5 kB  155 B/s
     http_req_blocked...............: avg=22.71µs  min=5.85µs   med=8.38µs   max=290.41µs p(50)=8.38µs   p(95)=55.33µs  p(99)=286.13µs
     http_req_connecting............: avg=7.46µs   min=0s       med=0s       max=177.27µs p(50)=0s       p(95)=0s       p(99)=169.11µs
     http_req_duration..............: avg=383.35ms min=2.91ms   med=375.69ms max=484.78ms p(50)=375.69ms p(95)=464.83ms p(99)=481.79ms
       { expected_response:true }...: avg=391.99ms min=365.55ms med=376.81ms max=484.78ms p(50)=376.81ms p(95)=465.05ms p(99)=481.86ms
     ✓ { name:auth }................: avg=391.99ms min=365.55ms med=376.81ms max=484.78ms p(50)=376.81ms p(95)=465.05ms p(99)=481.86ms
     http_req_failed................: 2.22%   1 out of 45
     ✓ { name:auth }................: 0.00%   0 out of 44
     http_req_receiving.............: avg=109.47µs min=71.34µs  med=106.94µs max=209.64µs p(50)=106.94µs p(95)=154.52µs p(99)=202.22µs
     http_req_sending...............: avg=50.44µs  min=29.22µs  med=40.67µs  max=125.2µs  p(50)=40.67µs  p(95)=116.13µs p(99)=125.15µs
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(50)=0s       p(95)=0s       p(99)=0s      
     http_req_waiting...............: avg=383.19ms min=2.66ms   med=375.45ms max=484.61ms p(50)=375.45ms p(95)=464.6ms  p(99)=481.62ms
     http_reqs......................: 45      0.734092/s
     iteration_duration.............: avg=1.39s    min=1.36s    med=1.37s    max=1.48s    p(50)=1.37s    p(95)=1.46s    p(99)=1.48s   
     iterations.....................: 44      0.717778/s
     vus............................: 1       min=1          max=1
     vus_max........................: 1       min=1          max=1


running (1m01.3s), 0/1 VUs, 44 complete and 0 interrupted iterations
default ✓ [ 100% ] 0/1 VUs  1m0s